Revit 2027 API
RebarInSystem.ArrayLength Property
 Identifies the distribution path length of rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ArrayLength { get; }
Public ReadOnly Property ArrayLength As Double
	Get
public:
property double ArrayLength {
	double get ();
}
member ArrayLength : float with get
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace